'''
==============================================================================================
@ Title: 2진수 8진수
@ URL: https://www.acmicpc.net/problem/1373
@ Author: jopemachine
@ Created Date: 12/14/2022, 10:19:20 PM
@ Tags: math string
@ Level: Bronze 1
@ Description:
2진수가 주어졌을 때, 8진수로 변환하는 프로그램을 작성하시오.
@ Input: 첫째 줄에 2진수가 주어진다. 주어지는 수의 길이는 1,000,000을 넘지 않는다.
@ Output: 첫째 줄에 주어진 수를 8진수로 변환하여 출력한다.
==============================================================================================
'''

N = input()
print(oct(int(N, 2))[2:])
