'''
==============================================================================================
@ Title: 단어 길이 재기
@ URL: https://www.acmicpc.net/problem/2743
@ Author: jopemachine
@ Created Date: 12/10/2022, 7:39:20 PM
@ Tags: implementation string
@ Level: Bronze 5
@ Description:
알파벳으로만 이루어진 단어를 입력받아, 그 길이를 출력하는 프로그램을 작성하시오.
@ Input: 첫째 줄에 영어 소문자와 대문자로만 이루어진 단어가 주어진다. 단어의 길이는 최대 100이다.
@ Output: 첫째 줄에 입력으로 주어진 단어의 길이를 출력한다.
==============================================================================================
'''

print(len(input()))