'''
==============================================================================================
@ Title: 웰컴
@ URL: https://www.acmicpc.net/problem/5337
@ Author: jopemachine
@ Created Date: 12/10/2022, 7:48:41 PM
@ Tags: implementation
@ Level: Bronze 5
@ Description:
Welcome을 예제 출력처럼 출력하는 프로그램을 작성하시오.
@ Input: 
@ Output: Welcome을 아래 예제 출력처럼 출력한다.
==============================================================================================
'''

print('''
.  .   .
|  | _ | _. _ ._ _  _
|/\|(/.|(_.(_)[ | )(/.
'''.strip())
