'''
==============================================================================================
@ Title: 마이크로소프트 로고
@ URL: https://www.acmicpc.net/problem/5338
@ Author: jopemachine
@ Created Date: 12/10/2022, 7:50:13 PM
@ Tags: implementation
@ Level: Bronze 5
@ Description:
마이크로소프트 로고를 예제 출력처럼 출력하는 프로그램을 작성하시오.
@ Input: 
@ Output: 마이크로소프트 로고를 예제 출력처럼 출력한다.
==============================================================================================
'''

print('''       _.-;;-._
'-..-'|   ||   |
'-..-'|_.-;;-._|
'-..-'|   ||   |
'-..-'|_.-''-._|''')
