'''
==============================================================================================
@ Title: 콜센터
@ URL: https://www.acmicpc.net/problem/5339
@ Author: jopemachine
@ Created Date: 12/10/2022, 7:52:21 PM
@ Tags: implementation
@ Level: Bronze 5
@ Description:
스타워즈에 등장하는 로봇인 C3PO는 요즘 콜센터에 근무하고 있다. 콜센터에 앉아있는 C3PO를 그리는 프로그램을 작성하시오.
@ Input: 
@ Output: 예제 출력처럼 콜센터에 앉아있는 C3PO를 출력한다. 마지막 세 줄의 두 '|' 사이에는 공백이 10개 있다.
==============================================================================================
'''

print('''     /~\\
    ( oo|
    _\\=/_
   /  _  \\
  //|/.\\|\\\\
 ||  \\ /  ||
============
|          |
|          |
|          |''')